In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/eu_arms_exports.csv', delimiter=';', header=None)

In [3]:
df.head()

     0   1    2         3  4  5  6  7  8   9          10 11
0  1998   0   AT   Austria                  a       1605
1  1998   0   AT   Austria                  b  208741703
2  1998   0   AT   Austria                  d         13
3  1998   0   BE   Belgium                  a       1067
4  1998   0   BE   Belgium                  b  649671652

In [4]:
df.drop(columns=[11], inplace=True)

In [5]:
columns = ["Year", "Embargo", "Source country","Source country name","Destination country","Destination country name","Region code","Region name","Rating","Category", "Value"]

In [6]:
len(columns)

11

In [7]:
df.columns = columns

In [8]:
df['Source country name'].nunique()

29

array([' ', ' DZ', ' AD', ' AR', ' AU', ' BH', ' BD', ' BB', ' BY', ' BE',
       ' BO', ' BA', ' BW', ' BR', ' BN', ' BG', ' KH', ' CM', ' CA',
       ' CL', ' CN', ' CO', ' CR', ' HR', ' CY', ' CZ', ' DK', ' DO',
       ' EC', ' EG', ' EE', ' FI', ' FR', ' GA', ' GE', ' DE', ' GR',
       ' GL', ' GT', ' GY', ' HN', ' HK', ' HU', ' IN', ' ID', ' IR',
       ' IE', ' IL', ' IT', ' JM', ' JP', ' JO', ' KZ', ' KE', ' KW',
       ' LV', ' LB', ' LI', ' LT', ' LU', ' MO', ' MK', ' MY', ' MU',
       ' MX', ' MD', ' MA', ' NA', ' NP', ' NL', ' NZ', ' NI', ' NG',
       ' NO', ' OM', ' PK', ' PA', ' PE', ' PH', ' PL', ' PT', ' QA',
       ' RO', ' RU', ' LC', ' SA', ' SG', ' SK', ' SI', ' ZA', ' KR',
       ' ES', ' SD', ' SR', ' SE', ' CH', ' TW', ' TZ', ' TH', ' TT',
       ' TN', ' TR', ' UA', ' AE', ' GB', ' US', ' UY', ' UZ', ' VE',
       ' VN', ' YE', ' ZM', ' ZW', ' AT', ' BJ', ' BF', ' CD', ' TL',
       ' SV', ' IS', ' MV', ' ML', ' MT', ' ER', ' GH', ' GN', ' CI',
       ' LY', ' MW', ' NE', ' SN', ' LK', ' TG', ' BZ', ' BT', ' DM',
       ' ET', ' FO', ' MN', ' PG', ' PY', ' RW', ' SM', ' SO', ' TM',
       ' SY', ' AZ', ' LA', ' MR', ' KP', ' SL', ' AO', ' TD', ' CU',
       ' AF', ' AL', ' AG', ' AM', ' BS', ' BI', ' CG', ' GQ', ' FJ',
       ' GM', ' GD', ' IQ', ' KG', ' LS', ' MC', ' MZ', ' MM', ' WS',
       ' SC', ' TJ', ' UG', ' NC', ' PW', ' DJ', ' HT', ' PS', ' VA',
       ' TO', ' CV', ' GW', ' MG', ' NR', ' KN', ' VC', ' SB', ' SZ',
       ' VU', ' LR', ' ST', ' PF', ' YT', ' AW', ' BM', ' KY', ' CF',
       ' FK', ' GI', ' RS', ' ME', ' VG', ' SH', ' TC', ' SS', ' KM',
       ' CW', ' BQ', ' GG', ' JE', ' MF', ' BL', ' MH'], dtype=object)

In [16]:
df[df['Destination country'] == ' MM'][df[df['Destination country'] == ' MM']['Year'] == 2020]

,Year,Embargo,Source country,Source country name,Destination country,Destination country name,Region code,Region name,Rating,Category,Value
231139,2020,0,,,MM,Myanmar,ASSE,South East Asia,ML21,d,1
231140,2020,0,,,MM,Myanmar,ASSE,South East Asia,ML7,d,1

## Export data per country across all available years

In [152]:
exports_df = df.groupby(by = 'Source country').sum()[['Value']]

In [153]:
exports_df.head()

                      Value
Source country
                  245986615
 AT             33383450600
 BE             29141822577
 BG             17091067547
 CY                19291983

In [154]:
exports_df.index = [country.strip() for country in exports_df.index]

In [155]:
exports_df.index

Index(['', 'AT', 'BE', 'BG', 'CY', 'CZ', 'DE', 'DK', 'EE', 'ES', 'FI', 'FR',
       'GB', 'GR', 'HR', 'HU', 'IE', 'IT', 'LT', 'LU', 'LV', 'MT', 'NL', 'PL',
       'PT', 'RO', 'SE', 'SI', 'SK'],
      dtype='object')

In [156]:
exports_df.to_csv('data/total_exports.csv')

In [157]:
exports_df.loc['AT', 'Value']

33383450600

In [62]:
df = pd.read_csv("data/total_exports.csv", index_col=0)

In [64]:
df.loc['Austria', 'Value']

33383450600

## Import Data per country across all years

In [9]:
imports_df = df.groupby(by = 'Destination country').sum()[['Value']]

In [10]:
imports_df

                            Value
Destination country
                      72222771572
 AD                      11971175
 AE                  121992061585
 AF                    2951762413
 AG                       1862150
...                           ...
 YE                     563178977
 YT                          7757
 ZA                   12062147607
 ZM                     375258450
 ZW                       1449048

[215 rows x 1 columns]

In [116]:
#imports_df.index = [country.strip() for country in imports_df.index]

In [139]:
imports_df.loc[:, 'Value'] = round(imports_df.Value/1_000_000)

In [140]:
#imports_df.index = [country.strip() for country in imports_df.index]

In [141]:
imports_df.describe()

               Value
count     215.000000
mean     8317.418605
std     20709.056330
min         0.000000
25%        11.500000
50%       391.000000
75%      4836.000000
max    141299.000000

In [11]:
imports_df.index = [x.strip() for x in imports_df.index]

In [12]:
imports_df

           Value
     72222771572
AD      11971175
AE  121992061585
AF    2951762413
AG       1862150
..           ...
YE     563178977
YT          7757
ZA   12062147607
ZM     375258450
ZW       1449048

[215 rows x 1 columns]

In [13]:
imports_df.to_csv('data/total_imports.csv')

In [14]:
pd.read_csv('data/total_imports.csv', index_col=0).loc['CA', 'Value']

29755755939

## Demodrcy Index

In [84]:
democracy_index_data = pd.read_csv('data/democracy_index.csv',  index_col=0)

In [85]:
democracy_index_data

,Regime type,2022,2021,2020,2019,2018,2017,2016,2015,2014,2013,2012,2011,2010,2008,2006
Country,,,,,,,,,,,,,,,,
Canada,Full democracy,8.88,8.87,9.24,9.22,9.15,9.15,9.15,9.08,9.08,9.08,9.08,9.08,9.08,9.07,9.07
United States,Flawed democracy,7.85,7.85,7.92,7.96,7.96,7.98,7.98,8.05,8.11,8.11,8.11,8.11,8.18,8.22,8.22
Austria,Full democracy,8.20,8.07,8.16,8.29,8.29,8.42,8.41,8.54,8.54,8.48,8.62,8.49,8.49,8.49,8.69
Belgium,Flawed democracy,7.64,7.51,7.51,7.64,7.78,7.78,7.77,7.93,7.93,8.05,8.05,8.05,8.05,8.16,8.15
Cyprus,Flawed democracy,7.38,7.43,7.56,7.59,7.59,7.59,7.65,7.53,7.40,7.29,7.29,7.29,7.29,7.70,7.60
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Tanzania,Hybrid regime,5.10,5.10,5.10,5.16,5.41,5.47,5.76,5.58,5.77,5.77,5.88,5.64,5.64,5.28,5.18
Togo,Authoritarian,2.99,2.80,2.80,3.30,3.10,3.05,3.32,3.41,3.45,3.45,3.45,3.45,3.45,2.43,1.75
Uganda,Hybrid regime,4.55,4.48,4.94,5.02,5.20,5.09,5.26,5.22,5.22,5.22,5.16,5.13,5.05,5.03,5.14
Zambia,Hybrid regime,5.80,5.72,4.86,5.09,5.61,5.68,5.99,6.28,6.39,6.26,6.26,6.19,5.68,5.25,5.25
Zimbabwe,Authoritarian,2.92,2.92,3.16,3.16,3.16,3.16,3.05,3.05,2.78,2.67,2.67,2.68,2.64,2.53,2.62